### 📖 Terraform Plan (src/core/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_resource_group.assets_cdn_itn will be created
  + resource "azurerm_resource_group" "assets_cdn_itn" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "io-p-itn-assets-cdn-rg-01"
      + tags     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
    }

  # azurerm_resource_group.external_itn will be created
  + resource "azurerm_resource_group" "external_itn" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "io-p-itn-external-rg-01"
      + tags     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
    }

  # module.networking_itn.azurerm_virtual_network.common will be updated in-place
  ~ resource "azurerm_virtual_network" "common" {
        id                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01"
        name                           = "io-p-itn-common-vnet-01"
        tags                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
        # (10 unchanged attributes hidden)

      - ddos_protection_plan {
          - enable = true -> null
          - id     = "/subscriptions/0da48c97-355f-4050-a520-f11a18b8be90/resourceGroups/sec-p-ddos/providers/Microsoft.Network/ddosProtectionPlans/sec-p-ddos-protection" -> null
        }
    }

  # module.azdoa_weu.module.azdoa_li_infra.azurerm_linux_virtual_machine_scale_set.this will be updated in-place
  ~ resource "azurerm_linux_virtual_machine_scale_set" "this" {
        id                                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-azdoa-rg/providers/Microsoft.Compute/virtualMachineScaleSets/io-p-azdoa-vmss-li-infra"
        name                                              = "io-p-azdoa-vmss-li-infra"
      ~ tags                                              = {
          + "BusinessUnit"                      = "App IO"
          + "CostCenter"                        = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"                         = "Terraform"
          + "Environment"                       = "Prod"
          + "ManagementTeam"                    = "IO Platform"
          + "Source"                            = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
            "__AzureDevOpsElasticPool"          = "io-prod-linux"
            "__AzureDevOpsElasticPoolTimeStamp" = "9/7/2025 10:44:16 AM"
        }
        # (32 unchanged attributes hidden)

      - scale_in {
          - force_deletion_enabled = false -> null
          - rule                   = "Default" -> null
        }

        # (4 unchanged blocks hidden)
    }

  # module.azdoa_weu.module.azdoa_li_infra.azurerm_ssh_public_key.this_public_key will be updated in-place
  ~ resource "azurerm_ssh_public_key" "this_public_key" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-azdoa-rg/providers/Microsoft.Compute/sshPublicKeys/io-p-azdoa-vmss-li-infra-admin-access-key"
        name                = "io-p-azdoa-vmss-li-infra-admin-access-key"
      ~ tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
        # (3 unchanged attributes hidden)
    }

  # module.azdoa_weu.module.azdoa_loadtest_li.azurerm_linux_virtual_machine_scale_set.this will be updated in-place
  ~ resource "azurerm_linux_virtual_machine_scale_set" "this" {
        id                                                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-azdoa-rg/providers/Microsoft.Compute/virtualMachineScaleSets/io-p-azdoa-vmss-loadtest-li"
        name                                              = "io-p-azdoa-vmss-loadtest-li"
      ~ tags                                              = {
          + "BusinessUnit"                      = "App IO"
          + "CostCenter"                        = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"                         = "Terraform"
          + "Environment"                       = "Prod"
          + "ManagementTeam"                    = "IO Platform"
          + "Source"                            = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
            "__AzureDevOpsElasticPool"          = "io-prod-loadtest-linux"
            "__AzureDevOpsElasticPoolTimeStamp" = "2/3/2024 10:56:53 AM"
        }
        # (32 unchanged attributes hidden)

      - scale_in {
          - force_deletion_enabled = false -> null
          - rule                   = "Default" -> null
        }

        # (4 unchanged blocks hidden)
    }

  # module.azdoa_weu.module.azdoa_loadtest_li.azurerm_ssh_public_key.this_public_key will be updated in-place
  ~ resource "azurerm_ssh_public_key" "this_public_key" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-azdoa-rg/providers/Microsoft.Compute/sshPublicKeys/io-p-azdoa-vmss-loadtest-li-admin-access-key"
        name                = "io-p-azdoa-vmss-loadtest-li-admin-access-key"
      ~ tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpn_weu.module.vpn.azurerm_public_ip.gw[0] must be replaced
-/+ resource "azurerm_public_ip" "gw" {
      ~ allocation_method       = "Dynamic" -> "Static"
      ~ fqdn                    = "iopvpngwratj6x.westeurope.cloudapp.azure.com" -> (known after apply)
      ~ id                      = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/publicIPAddresses/io-p-vpn-gw-pip" -> (known after apply)
      ~ ip_address              = "52.143.53.175" -> (known after apply)
      - ip_tags                 = {} -> null
        name                    = "io-p-vpn-gw-pip"
      ~ sku                     = "Basic" -> "Standard" # forces replacement
        tags                    = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
      - zones                   = [] -> null
        # (10 unchanged attributes hidden)
    }

  # module.vpn_weu.module.vpn.azurerm_virtual_network_gateway.gw will be updated in-place
  ~ resource "azurerm_virtual_network_gateway" "gw" {
        id                                    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/virtualNetworkGateways/io-p-vpn-gw"
        name                                  = "io-p-vpn-gw"
        tags                                  = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/core/prod"
        }
        # (15 unchanged attributes hidden)

      ~ ip_configuration {
            name                          = "io-p-vpn-gw-config"
          ~ public_ip_address_id          = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/publicIPAddresses/io-p-vpn-gw-pip" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 6 to change, 1 to destroy.

Changes to Outputs:
  ~ resource_groups    = {
      ~ italynorth = {
          + assets_cdn     = "io-p-itn-assets-cdn-rg-01"
          + external       = "io-p-itn-external-rg-01"
            # (4 unchanged attributes hidden)
        }
        # (1 unchanged attribute hidden)
    }

Warning: Deprecated attribute

  on ../_modules/key_vaults/iam.tf line 13, in module "iam_tlscert_kv_admins":
  13:     has_rbac_support    = azurerm_key_vault.tlscert_itn_01.enable_rbac_authorization

The attribute "enable_rbac_authorization" is deprecated. Refer to the
provider documentation for details.

(and one more similar warning elsewhere)

Warning: Argument is deprecated

  with module.key_vault_weu.azurerm_key_vault.io_p_itn_platform_kv_01,
  on ../_modules/key_vaults/kv_italynorth.tf line 10, in resource "azurerm_key_vault" "io_p_itn_platform_kv_01":
  10:   enable_rbac_authorization = true

This property has been renamed to `rbac_authorization_enabled` and will be
removed in v5.0 of the provider

(and 3 more similar warnings elsewhere)
```

</details>
